
const HONGKONG = [
  ['810000', ['香港', '香港', 'Hong Kong'], '1'],
  ['810200', ['九龙', '九龍', 'Kowloon'], '810000'],
  ['810205', ['观塘', '觀塘', 'Kwun'], '810200'],
  ['810204', ['黄大仙', '黃大仙', 'Wong Tai Sin'], '810200'],
  ['810201', ['九龙城', '九龍城', 'City'], '810200'],
  ['810203', ['深水埗', '深水埗', 'Sham Shui Po'], '810200'],
  ['810202', ['油尖旺', '油尖旺', 'Yau Tsim Mong'], '810200'],
  ['810100', ['香港岛', '香港島', 'Hong Kong Island'], '810000'],
  ['810103', ['东区', '東區', 'Eastern District'], '810100'],
  ['810104', ['南区', '南區', 'South area'], '810100'],
  ['810102', ['湾仔', '灣仔', 'Wan Chai'], '810100'],
  ['810101', ['中西', '中西', 'Chinese and Western'], '810100'],
  ['810300', ['新界', '新界', 'New Territories'], '810000'],
  ['810301', ['北区', '北區', 'North District'], '810300'],
  ['810302', ['大埔', '大埔', 'Tai Po'], '810300'],
  ['810308', ['葵青', '葵青', 'Kwai Tsing'], '810300'],
  ['810309', ['离岛', '離島', 'Remote island'], '810300'],
  ['810307', ['荃湾', '荃灣', 'Tsuen Wan'], '810300'],
  ['810303', ['沙田', '沙田', 'Sha Tin'], '810300'],
  ['810306', ['屯门', '屯門', 'Trick'], '810300'],
  ['810304', ['西贡', '西貢', 'Saigon'], '810300'],
  ['810305', ['元朗', '元朗', 'Yuen Long'], '810300'],
  ['820000', ['澳门', '澳門', 'Macao'], '1'],
  ['820100', ['澳门半岛', '澳門半島', 'Macau Peninsula'], '820000'],
  ['820200', ['离岛', '離島', 'Remote island'], '820000']
];

function toTreeData(data) {
  return data.map(item => ({
    id: item[0],
    title: item[1][0],
    traditionalTitle: item[1][1],
    pinyinTitle: item[1][2],
    parentId: item[2]
  }));
}

export default function () {
  return toTreeData(HONGKONG);
}
